# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'dbngin'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'java'
cask 'mysqlworkbench'
cask 'skype'
cask 'slack'
cask 'steam'
cask 'tableplus'
cask 'the-unarchiver'
cask 'transmission'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'easy-move-plus-resize'
cask 'iterm2'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-open-sans'
cask 'font-fira-code'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
