# Taps
tap 'homebrew/cask'
tap 'caskroom/fonts'

# Binaries
brew 'zsh'
brew 'zsh-completions'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'tree' # List directories in a tree structure
brew 'tldr'
brew 'curl'
brew 'macvim'

# Development
brew 'php'
brew 'imagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'

# Apps
cask 'alfred'
# cask 'caffeine'
# cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'github-desktop'
cask 'gpg-suite'
cask 'java'
cask 'vlc'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'visual-studio-code'
cask 'iterm2'
cask 'postman'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-fira-code'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
